app/Controllers/AuthController.php

INSERT INTO `users` (`name`, `email`, `password`, `created_at`) VALUES ('Faith Hope', 'fayol@gmail.com', '$2y$10$F3j5/RzyjmevOju3k3j65O0ABFnRIntLD4GZ4LI9T3haQR4LgSWQK', '2026-06-14 17:43:17')
---
    public function processRegister()
    {
        $rules = [
            'name'     => 'required|min_length[3]',
            'email'    => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->with('error', $this->validator->getErrors());
        }

        $userModel = new UserModel();
        $userModel->save([
            'name'     => $this->request->getPost('name'),
            'email'    => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT)
        ]);

SELECT *
FROM `users`
WHERE `email` = 'fayol@gmail.com'
 LIMIT 1
---
    public function processLogin()
    {
        $session = session();
        $userModel = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->first();