app/Controllers/ClientController.php

    public function index()
    {
        $pdfModel = new PdfModel();

        // Fetch all PDFs, ordering by the most recently uploaded first
        $data['pdfs'] = $pdfModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `pdfs`
ORDER BY `created_at` DESC